//7월
const Map<String,List<Map<String,dynamic>>> CalendarJsonJuly = {
  "월":[{"일자":4,'상태':'좋음','건수':2}, {"일자":11,'상태':'좋음','건수':3}, {"일자":18,'상태':'보통','건수':1}, {"일자":25,'상태':'좋음','건수':2}, ],
  "화":[{"일자":5,'상태':'슬픔','건수':1}, {"일자":12,'상태':'슬픔','건수':1}, {"일자":19,'상태':'좋음','건수':2}, {"일자":26,'상태':'보통','건수':1}, ],
  "수":[{"일자":6,'상태':'좋음','건수':3}, {"일자":13,'상태':'슬픔','건수':1}, {"일자":20,'상태':'좋음','건수':1}, {"일자":27,'상태':'슬픔','건수':3}, ],
  "목":[{"일자":7,'상태':'슬픔','건수':1}, {"일자":14,'상태':'좋음','건수':2}, {"일자":21,'상태':'보통','건수':1}, {"일자":28,'상태':'좋음','건수':1}, ],
  "금":[{"일자":1,'상태':'좋음','건수':1}, {"일자":8,'상태':'좋음','건수':2}, {"일자":15,'상태':'보통','건수':1}, {"일자":22,'상태':'보통','건수':1}, {"일자":29,'상태':'좋음','건수':1}, ],
  "토":[{"일자":2,'상태':'기쁨','건수':1}, {"일자":9,'상태':'좋음','건수':1}, {"일자":16,'상태':'좋음','건수':3}, {"일자":23,'상태':'좋음','건수':1}, {"일자":30,'상태':'슬픔','건수':2}, ],
  "일":[{"일자":3,'상태':'좋음','건수':1}, {"일자":10,'상태':'보통','건수':1}, {"일자":17,'상태':'좋음','건수':1}, {"일자":24,'상태':'좋음','건수':1}, {"일자":31,'상태':'보통','건수':1}, ],
};

//8월
const Map<String,List<Map<String,dynamic>>> CalendarJsonAugust = {
  "월":[{"일자":1,'상태':'좋음','건수':1}, {"일자":8,'상태':'좋음','건수':2}, {"일자":15,'상태':'보통','건수':1}, {"일자":22,'상태':'보통','건수':1}, {"일자":29,'상태':'좋음','건수':1}, ],
  "화":[{"일자":2,'상태':'기쁨','건수':1}, {"일자":9,'상태':'좋음','건수':1}, {"일자":16,'상태':'좋음','건수':3}, {"일자":23,'상태':'좋음','건수':1}, {"일자":30,'상태':'슬픔','건수':2}, ],
  "수":[{"일자":3,'상태':'좋음','건수':1}, {"일자":10,'상태':'보통','건수':1}, {"일자":17,'상태':'좋음','건수':1}, {"일자":24,'상태':'좋음','건수':1}, {"일자":31,'상태':'보통','건수':1}, ],
  "목":[{"일자":4,'상태':'좋음','건수':2}, {"일자":11,'상태':'좋음','건수':3}, {"일자":18,'상태':'보통','건수':1}, {"일자":25,'상태':'좋음','건수':2}, ],
  "금":[{"일자":5,'상태':'슬픔','건수':1}, {"일자":12,'상태':'슬픔','건수':1}, {"일자":19,'상태':'좋음','건수':2}, {"일자":26,'상태':'보통','건수':1}, ],
  "토":[{"일자":6,'상태':'좋음','건수':3}, {"일자":13,'상태':'슬픔','건수':1}, {"일자":20,'상태':'좋음','건수':1}, {"일자":27,'상태':'슬픔','건수':3}, ],
  "일":[{"일자":7,'상태':'슬픔','건수':1}, {"일자":14,'상태':'좋음','건수':2}, {"일자":21,'상태':'보통','건수':1}, {"일자":28,'상태':'좋음','건수':1}, ],
};

//9월
const Map<String,List<Map<String,dynamic>>> CalendarJsonSeptember = {
  "월":[{"일자":5,'상태':'슬픔','건수':1}, {"일자":12,'상태':'슬픔','건수':1}, {"일자":19,'상태':'좋음','건수':2}, {"일자":26,'상태':'보통','건수':1}, ],
  "화":[{"일자":6,'상태':'좋음','건수':3}, {"일자":13,'상태':'슬픔','건수':1}, {"일자":20,'상태':'좋음','건수':1}, {"일자":27,'상태':'슬픔','건수':3}, ],
  "수":[{"일자":7,'상태':'슬픔','건수':1}, {"일자":14,'상태':'좋음','건수':2}, {"일자":21,'상태':'보통','건수':1}, {"일자":28,'상태':'좋음','건수':1}, ],
  "목":[{"일자":1,'상태':'좋음','건수':1}, {"일자":8,'상태':'좋음','건수':2}, {"일자":15,'상태':'보통','건수':1}, {"일자":22,'상태':'보통','건수':1}, {"일자":29,'상태':'좋음','건수':1}, ],
  "금":[{"일자":2,'상태':'기쁨','건수':1}, {"일자":9,'상태':'좋음','건수':1}, {"일자":16,'상태':'좋음','건수':3}, {"일자":23,'상태':'좋음','건수':1}, {"일자":30,'상태':'슬픔','건수':2}, ],
  "토":[{"일자":3,'상태':'좋음','건수':1}, {"일자":10,'상태':'보통','건수':1}, {"일자":17,'상태':'좋음','건수':1}, {"일자":24,'상태':'좋음','건수':1}],
  "일":[{"일자":4,'상태':'좋음','건수':2}, {"일자":11,'상태':'좋음','건수':3}, {"일자":18,'상태':'보통','건수':1}, {"일자":25,'상태':'좋음','건수':2}, ],
};

//const  CalendarJson = [{
//   "월":[[{"일자":1,'상태':'좋음','건수':1}], [{"일자":8,'상태':'좋음','건수':1}], [{"일자":15,'상태':'좋음','건수':1}], [{"일자":22,'상태':'좋음','건수':1}], [{"일자":29,'상태':'좋음','건수':1}],],
//   "화":[[{"일자":2,'상태':'좋음','건수':1}], [{"일자":9,'상태':'좋음','건수':1}], [{"일자":16,'상태':'좋음','건수':1}], [{"일자":23,'상태':'좋음','건수':1}], [{"일자":30,'상태':'좋음','건수':1}],],
//   "수":[[{"일자":3,'상태':'좋음','건수':1}], [{"일자":10,'상태':'좋음','건수':1}], [{"일자":17,'상태':'좋음','건수':1}], [{"일자":24,'상태':'좋음','건수':1}], [{"일자":31,'상태':'좋음','건수':1}],],
//   "목":[[{"일자":4,'상태':'좋음','건수':1}], [{"일자":11,'상태':'좋음','건수':1}], [{"일자":18,'상태':'좋음','건수':1}], ],
//   "금":[[{"일자":5,'상태':'좋음','건수':1}], [{"일자":12,'상태':'좋음','건수':1}], [{"일자":19,'상태':'좋음','건수':1}], ],
//   "토":[[{"일자":6,'상태':'좋음','건수':1}], [{"일자":13,'상태':'좋음','건수':1}], [{"일자":20,'상태':'좋음','건수':1}], ],
//   "일":[[{"일자":7,'상태':'좋음','건수':1}], [{"일자":14,'상태':'좋음','건수':1}], [{"일자":21,'상태':'좋음','건수':1}], ],
// }];